{"version":2,"kind":"Article","sha256":"7e55904a07a1bb2cf7d30a25e8b8948f47fc21fb88cdb1e8b2891b30dd34393b","slug":"chapters.01.1.intro","location":"/chapters/01/1/intro.md","dependencies":[],"frontmatter":{"title":"Introduction","content_includes_title":false,"license":{"content":{"id":"CC-BY-NC-ND-4.0","url":"https://creativecommons.org/licenses/by-nc-nd/4.0/","name":"Creative Commons Attribution Non Commercial No Derivatives 4.0 International","CC":true}},"github":"https://github.com/data-8/textbook","numbering":{"title":{"enabled":true,"offset":1}},"source_url":"https://github.com/data-8/textbook/blob/main/chapters/01/1/intro.md","edit_url":"https://github.com/data-8/textbook/edit/main/chapters/01/1/intro.md","enumerator":"1.1","exports":[{"format":"md","filename":"intro.md","url":"/build/intro-99e8382f6d2fdf6c07cd84dc88537b4e.md"}]},"mdast":{"type":"root","children":[{"type":"block","children":[{"type":"paragraph","position":{"start":{"line":4,"column":1},"end":{"line":14,"column":1}},"children":[{"type":"text","value":"Data are descriptions of the world around us, collected through observation and\nstored on computers. Computers enable us to infer properties of the world from\nthese descriptions. Data science is the discipline of drawing conclusions from\ndata using computation. There are three core aspects of effective data\nanalysis: exploration, prediction, and inference. This text develops a\nconsistent approach to all three, introducing statistical ideas and fundamental\nideas in computer science concurrently. We focus on a minimal set of core\ntechniques that can be applied to a vast range of real-world\napplications. A foundation in data science requires not only understanding\nstatistical and computational techniques, but also recognizing how they apply\nto real scenarios.","position":{"start":{"line":4,"column":1},"end":{"line":4,"column":1}},"key":"DPALC7a4Dj"}],"key":"EKFQDnBttH"},{"type":"paragraph","position":{"start":{"line":16,"column":1},"end":{"line":20,"column":1}},"children":[{"type":"text","value":"For whatever aspect of the world we wish to study—whether it’s the Earth’s\nweather, the world’s markets, political polls, or the human mind—data we\ncollect typically offer an incomplete description of the subject at hand. A\ncentral challenge of data science is to make reliable conclusions using this\npartial information.","position":{"start":{"line":16,"column":1},"end":{"line":16,"column":1}},"key":"Lvi7rZdzwx"}],"key":"YYhReYdzWO"},{"type":"paragraph","position":{"start":{"line":22,"column":1},"end":{"line":31,"column":1}},"children":[{"type":"text","value":"In this endeavor, we will combine two essential tools: computation and\nrandomization. For example, we may want to understand climate change trends\nusing temperature observations. Computers will allow us to use all available\ninformation to draw conclusions. Rather than focusing only on the average\ntemperature of a region, we will consider the whole range of temperatures\ntogether to construct a more nuanced analysis. Randomness will allow us to\nconsider the many different ways in which incomplete information might be\ncompleted. Rather than assuming that temperatures vary in a particular way, we\nwill learn to use randomness as a way to imagine many possible scenarios that\nare all consistent with the data we observe.","position":{"start":{"line":22,"column":1},"end":{"line":22,"column":1}},"key":"P9ri5xstWI"}],"key":"ueVVR19EHU"},{"type":"paragraph","position":{"start":{"line":33,"column":1},"end":{"line":41,"column":1}},"children":[{"type":"text","value":"Applying this approach requires learning to program a computer, and so this\ntext interleaves a complete introduction to programming that assumes no prior\nknowledge. Readers with programming experience will find that we cover several\ntopics in computation that do not appear in a typical introductory computer\nscience curriculum. Data science also requires careful reasoning about numerical\nquantities, but this text does not assume any background in mathematics or\nstatistics beyond basic algebra. You will find very few equations in this text.\nInstead, techniques are described to readers in the same language in which they\nare described to the computers that execute them—a programming language.","position":{"start":{"line":33,"column":1},"end":{"line":33,"column":1}},"key":"gvcWBAPHAo"}],"key":"J865RGmAUY"}],"key":"qxlVA9Poxi"}],"key":"nekXTnSJhJ"},"references":{"cite":{"order":[],"data":{}}},"footer":{"navigation":{"prev":{"title":"What is Data Science?","url":"/chapters/01/what-is-data-science","group":"Computational and Inferential Thinking"},"next":{"title":"Computational Tools","url":"/chapters/01/1/1/computational-tools","group":"Computational and Inferential Thinking"}}},"domain":"http://localhost:3000"}